import QueriesWindow from "./QueriesWindow";
import {observer} from "mobx-react";
import {Typography} from "antd";

const {Title} = Typography;

const QueriesPage = () => {
	return (
		<>
			<Title>Запити</Title>
			<QueriesWindow queries={
				[
					{id: 1, text: "Скласти список працівників, що займають посаду касира, відсортованих за прізвищем;", deps: []},
					{id: 2, text: "Скласти список товарів, що належать певній категорії, відсортованих за назвою;", deps: ['category']},
					{id: 3, text: "За прізвищем працівника знайти його телефон та адресу;", deps: ['empl_surname']},
					{id: 4, text: "Скласти список усіх товарів, відсортованих за назвою;", deps: []},
					{id: 5, text: "Скласти список усіх категорій, відсортованих за назвою;", deps: []},
					{id: 6, text: "Скласти список всіх товарів, що належать певній категорії:", deps: ['category']},
					{id: 7, text: "Скласти список товарів у магазині, що належать певному товару;", deps: ['good']},
					{id: 8, text: "За UPC-товару знайти ціну продажу товару, кількість наявних одиниць товару.", deps: ['shop_good']},
					{id: 9, text: "Скласти список усіх акційних товарів, відсортованих за кількістю одиниць товару/ за назвою;", deps: []},
					{id: 11, text: "Скласти список усіх не акційних товарів, відсортованих за кількістю одиниць товару/ за назвою;", deps: []},
					{id: 15, text: "Загальна сума проданих товарів з чеків, видрукуваних певним касиром за певний період часу;", deps: ['employee', 'time_period']},
					{id: 16, text: "Загальна сума проданих товарів з чеків, видрукуваних усіма касиром за певний період часу;", deps: ['time_period']},
					{id: 17, text: "Визначити загальну кількість одиниць певного товару, проданого за певний період часу;", deps: ['shop_good', 'time_period']},
					{id: 18, text: "Скласти список усіх постійних клієнтів, що мають карту клієнта, по полях  ПІБ, телефон, адреса (якщо вказана);", deps: []},
					{id: 19, text: "Скласти список усіх постійних клієнтів, що мають карту клієнта із певним відсотком.", deps: ['percent']},
					{id: 20, text: "За UPC-товару знайти ціну продажу товару, кількість наявних одиниць товару, назву та характеристики товару.", deps: ['shop_good']},
					{id: 21, text: "Скласти список чеків,  видрукуваних даним касиром за певний період часу;", deps: ['employee', 'time_period']},
					{id: 22, text: "За номером чеку вивести усю інформацію про даний чек.", deps: ['receipt']},
					{id: 23, text: "Вивести усю інформацію про покупця з певним прізвищем, що має карту клієнта;", deps: ['cust_surname']},
					{id: 24, text: "Список усіх постійних клієнтів, що мають карту клієнта з певним відсотком;", deps: ['percent']},
					{id: 25, text: "Скласти список товарів, що належать певній категорії, відсортованих за назвою;", deps: ['category']},
					{id: 26, text: "Скласти список усіх товарів, відсортований за назвою;", deps: []},
					{id: 27, text: "Скласти список усіх акційних товарів, відсортованих за кількістю одиниць товару/ за назвою;", deps: []},
					{id: 29, text: "Скласти список усіх не акційних товарів, відсортованих за кількістю одиниць товару/ за назвою;", deps: []},
					{id: 31, text: "За номером чека скласти список усіх товарів, інформація про продаж яких є у цьому чеку;", deps: ['receipt']},
					{id: 32, text: "За UPC-товару знайти ціну продажу товару, кількість наявних одиниць товару.", deps: ['shop_good']},
					{id: 33, text: "За ID_працівника знайти всю інформацію про себе.", deps: ['employee']}
				]
			}
			/>
		</>
	);
}

export default observer(QueriesPage);
